namespace ASP.Services.Hash
{
	public interface IHashService
	{
		String Digest(String input);
	}
}

/* Криптографічна геш-функція, або просто геш -
* алгоритм, який з даних довільної довжини
* обчислює дайджест постійної довжини. Ця довжина
* у бітах є характеристикою гешу (128-бітний, 160-, 256 -... )
* Використовується у задачах контролю цілісності
* Справильності передачі) - порівнюються хеш-дайджести
* файлів до передачі та після прийому. А також для задач
* цифрового підпису - підписується не сам документ, а
* його геш (дайджест), тому до крипто-гешів є додаткова
* умова непередбачуваності (знаючи дайджест неможна
* відтворити сам документ чи його аналог, неможна створити
* два документи, що мають однаковий дайджест)
* 
* У задачах програмування геш також вживається для
* збереження паролів у БД. Дайджест подається у вигляді
* гексадецимального рядка
* рядок				дайджест (MD5)
* "123"				202СВ962AC59075B964B07152D234B70
* "Hello, World!"	65A8E27D8879283831B664BD8B7F0AD4
*/